# Pandas: A Python Library for Data Analysis

Notebook Author: Matthew Kearns

### The reference material for this notebook can be found in the pandas.pydata.org tutorial: http://pandas.pydata.org/pandas-docs/stable/10min.html

Notebook Contents:

    - Object creation
    - Viewing data
    - Selection
        - Getting
        - Selection by label
        - Selection by position
        - Boolean indexing
        - Setting
    - Missing data
    - Operations
        - Stats
        - Apply
        - Histogramming
        - String methods
    - Merge
        - Concat
        - Append
    - Grouping
    - Reshaping
        - Pivot tables
    - Categoricals
    - Getting data in/out
        - CSV
        - HDF5
        - Excel

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

### Object creation

In [2]:
# creating a Series by passing a list of values
squares = pd.Series([(x+1)**2 for x in range(10)])
squares

0      1
1      4
2      9
3     16
4     25
5     36
6     49
7     64
8     81
9    100
dtype: int64

In [3]:
# creating a data frame by passing a NumPy array and datetime index
dates = pd.date_range('20180101', periods=365)

In [4]:
dates

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-06', '2018-01-07', '2018-01-08',
               '2018-01-09', '2018-01-10',
               ...
               '2018-12-22', '2018-12-23', '2018-12-24', '2018-12-25',
               '2018-12-26', '2018-12-27', '2018-12-28', '2018-12-29',
               '2018-12-30', '2018-12-31'],
              dtype='datetime64[ns]', length=365, freq='D')

In [5]:
df = pd.DataFrame(np.random.randn(365, 5), index=dates, columns=list('ABCDE'))

In [7]:
df.head()

                   A         B         C         D         E
2018-01-01  1.904261  0.668598  0.633009  0.804681  0.010530
2018-01-02 -0.136654 -0.405667  0.660185 -0.536618 -0.173108
2018-01-03  1.172189  0.819352  0.010252  0.973735  1.618968
2018-01-04 -0.290405 -0.484918  0.887774  0.685885 -0.046122
2018-01-05  0.591977 -0.935458 -0.772485  0.420939  1.194874

In [8]:
# creating a data frame with heterogeneous columns
df = pd.DataFrame({'A': pd.Timestamp('20180607'),
                   'B': np.array([1, 2, 3]), 
                   'C': pd.Categorical(['Monday', 'Tuesday', 'Wednesday']), 
                   'D': 'foo'})
df.dtypes

A    datetime64[ns]
B             int32
C          category
D            object
dtype: object

### Viewing data

In [17]:
# viewing the top and bottom rows of a data frame
dates = pd.date_range('20180101', periods=7)

df = pd.DataFrame(np.random.randn(7, 5), index=dates, columns=list('ABCDE'))

print('\ndf.head():\n', df.head())
print('\ndf.tail():\n', df.tail())

df.head():
                    A         B         C         D         E
2018-01-01  0.147916 -0.037493  0.060506 -0.381192 -1.888366
2018-01-02 -0.134965  0.029424 -0.954688  0.082766  0.693828
2018-01-03 -1.394146 -0.596004  1.962957 -0.149231 -0.046938
2018-01-04  0.815478  0.178928  0.018747  0.767455 -1.076740
2018-01-05 -0.398978  1.463726 -0.995175  0.165350 -2.179177

df.tail():
                    A         B         C         D         E
2018-01-03 -1.394146 -0.596004  1.962957 -0.149231 -0.046938
2018-01-04  0.815478  0.178928  0.018747  0.767455 -1.076740
2018-01-05 -0.398978  1.463726 -0.995175  0.165350 -2.179177
2018-01-06 -1.188608  0.401013  0.086184  1.060617 -1.700875
2018-01-07 -2.278527 -0.413172  0.803698  1.847506 -0.627094

In [18]:
# displaying the index, columns, and underlying NumPy data
df.index

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-06', '2018-01-07'],
              dtype='datetime64[ns]', freq='D')

In [19]:
df.columns

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [20]:
df.values

array([[ 0.1479163 , -0.03749284,  0.06050551, -0.38119195, -1.88836615],
       [-0.13496508,  0.02942439, -0.95468821,  0.0827655 ,  0.69382753],
       [-1.39414635, -0.59600413,  1.96295726, -0.14923061, -0.04693848],
       [ 0.81547785,  0.17892775,  0.01874695,  0.7674545 , -1.07674005],
       [-0.39897775,  1.46372571, -0.99517481,  0.16534961, -2.17917698],
       [-1.18860772,  0.40101304,  0.08618361,  1.06061689, -1.70087527],
       [-2.27852672, -0.41317181,  0.80369759,  1.84750646, -0.62709396]])

In [21]:
# quick statistics summary of the data
df.describe()

              A         B         C         D         E
count  7.000000  7.000000  7.000000  7.000000  7.000000
mean  -0.633118  0.146632  0.140318  0.484753 -0.975052
std    1.049327  0.672435  1.022623  0.783586  1.047922
min   -2.278527 -0.596004 -0.995175 -0.381192 -2.179177
25%   -1.291377 -0.225332 -0.467971 -0.033233 -1.794621
50%   -0.398978  0.029424  0.060506  0.165350 -1.076740
75%    0.006476  0.289970  0.444941  0.914036 -0.337016
max    0.815478  1.463726  1.962957  1.847506  0.693828

In [22]:
# the transpose of the data
df.T

,2018-01-01 00:00:00,2018-01-02 00:00:00,2018-01-03 00:00:00,2018-01-04 00:00:00,2018-01-05 00:00:00,2018-01-06 00:00:00,2018-01-07 00:00:00
A,0.147916,-0.134965,-1.394146,0.815478,-0.398978,-1.188608,-2.278527
B,-0.037493,0.029424,-0.596004,0.178928,1.463726,0.401013,-0.413172
C,0.060506,-0.954688,1.962957,0.018747,-0.995175,0.086184,0.803698
D,-0.381192,0.082766,-0.149231,0.767455,0.165350,1.060617,1.847506
E,-1.888366,0.693828,-0.046938,-1.076740,-2.179177,-1.700875,-0.627094

In [23]:
# sorting by axis
df.sort_index(axis=1, ascending=False)

                   E         D         C         B         A
2018-01-01 -1.888366 -0.381192  0.060506 -0.037493  0.147916
2018-01-02  0.693828  0.082766 -0.954688  0.029424 -0.134965
2018-01-03 -0.046938 -0.149231  1.962957 -0.596004 -1.394146
2018-01-04 -1.076740  0.767455  0.018747  0.178928  0.815478
2018-01-05 -2.179177  0.165350 -0.995175  1.463726 -0.398978
2018-01-06 -1.700875  1.060617  0.086184  0.401013 -1.188608
2018-01-07 -0.627094  1.847506  0.803698 -0.413172 -2.278527

In [24]:
# sorting by values
df.sort_values(by='A')

                   A         B         C         D         E
2018-01-07 -2.278527 -0.413172  0.803698  1.847506 -0.627094
2018-01-03 -1.394146 -0.596004  1.962957 -0.149231 -0.046938
2018-01-06 -1.188608  0.401013  0.086184  1.060617 -1.700875
2018-01-05 -0.398978  1.463726 -0.995175  0.165350 -2.179177
2018-01-02 -0.134965  0.029424 -0.954688  0.082766  0.693828
2018-01-01  0.147916 -0.037493  0.060506 -0.381192 -1.888366
2018-01-04  0.815478  0.178928  0.018747  0.767455 -1.076740

### Selection

###### Getting

In [25]:
# select an column
df['A']

2018-01-01    0.147916
2018-01-02   -0.134965
2018-01-03   -1.394146
2018-01-04    0.815478
2018-01-05   -0.398978
2018-01-06   -1.188608
2018-01-07   -2.278527
Freq: D, Name: A, dtype: float64

In [27]:
# select rows by slicing
df[0:3]

                   A         B         C         D         E
2018-01-01  0.147916 -0.037493  0.060506 -0.381192 -1.888366
2018-01-02 -0.134965  0.029424 -0.954688  0.082766  0.693828
2018-01-03 -1.394146 -0.596004  1.962957 -0.149231 -0.046938

###### Selection by label

In [28]:
df.loc[dates[0]]

A    0.147916
B   -0.037493
C    0.060506
D   -0.381192
E   -1.888366
Name: 2018-01-01 00:00:00, dtype: float64

In [29]:
df.loc[:, ['A', 'B', 'C']] # select all rows, columns A, B, and C

                   A         B         C
2018-01-01  0.147916 -0.037493  0.060506
2018-01-02 -0.134965  0.029424 -0.954688
2018-01-03 -1.394146 -0.596004  1.962957
2018-01-04  0.815478  0.178928  0.018747
2018-01-05 -0.398978  1.463726 -0.995175
2018-01-06 -1.188608  0.401013  0.086184
2018-01-07 -2.278527 -0.413172  0.803698

In [35]:
# select by row labels and column labels
df.loc['20180101':'20180105', ['A', 'B', 'C']]

                   A         B         C
2018-01-01  0.147916 -0.037493  0.060506
2018-01-02 -0.134965  0.029424 -0.954688
2018-01-03 -1.394146 -0.596004  1.962957
2018-01-04  0.815478  0.178928  0.018747
2018-01-05 -0.398978  1.463726 -0.995175

In [36]:
# fast access to a scalar value
df.at[dates[0], 'A']

0.14791629697503672

###### Selection by position

In [39]:
df.iloc[0:3, 0:3]

                   A         B         C
2018-01-01  0.147916 -0.037493  0.060506
2018-01-02 -0.134965  0.029424 -0.954688
2018-01-03 -1.394146 -0.596004  1.962957

In [41]:
# arbitrarily selecting by row and column indices
df.iloc[[0, 1, 3],[0, 2, 3]]

                   A         C         D
2018-01-01  0.147916  0.060506 -0.381192
2018-01-02 -0.134965 -0.954688  0.082766
2018-01-04  0.815478  0.018747  0.767455

In [46]:
# we can slice by rows or columns
col_1 = df.iloc[:, 0] # first column
row_1 = df.iloc[0, :] # first row

print('\nColumn 1:\n', col_1.values)
print('\nRow 1:\n', row_1.values)

Column 1:
 [ 0.1479163  -0.13496508 -1.39414635  0.81547785 -0.39897775 -1.18860772
 -2.27852672]

Row 1:
 [ 0.1479163  -0.03749284  0.06050551 -0.38119195 -1.88836615]

In [47]:
# again, getting fast access to a scalar
df.iat[0, 0]

0.14791629697503672

###### Boolean indexing

In [95]:
days = ['Sun', 'Mon', 'Tue', 'Wed', 'Thu', 'Fri', 'Sat']
weeks = np.array([str(2000 + x) for x in range(10)])

# average car crashes by day of week per year (random)
data = np.floor(np.abs(10*np.random.randn(10, 7)))

df = pd.DataFrame(data, index=weeks, columns=days)

# Select all years where average # crashes on Sundays > 10   
print(df[df['Sun'] > 5])

       Sun   Mon   Tue   Wed   Thu   Fri  Sat
2001   8.0   1.0  10.0  20.0  25.0  11.0  7.0
2003   7.0  13.0   8.0   7.0  20.0  16.0  3.0
2005   6.0  20.0  12.0   8.0  13.0  17.0  8.0
2006  13.0   3.0  30.0  20.0   8.0   7.0  2.0
2009   7.0  14.0  10.0   1.0   7.0   1.0  1.0

###### Setting

In [100]:
# use df.loc[] to set by row or column name

# set first column all to 0's
df.loc[:, ['Sun']] = np.zeros((10, 1))

# set first row all to 1's
df.loc['2000', :] = np.ones((1, 7))

In [101]:
df

      Sun   Mon   Tue   Wed   Thu   Fri  Sat
2000  1.0   1.0   1.0   1.0   1.0   1.0  1.0
2001  0.0   1.0  10.0  20.0  25.0  11.0  7.0
2002  0.0  15.0   3.0  11.0   2.0   6.0  9.0
2003  0.0  13.0   8.0   7.0  20.0  16.0  3.0
2004  0.0   8.0   7.0   5.0  13.0   1.0  1.0
2005  0.0  20.0  12.0   8.0  13.0  17.0  8.0
2006  0.0   3.0  30.0  20.0   8.0   7.0  2.0
2007  0.0   6.0  13.0  10.0  13.0   7.0  2.0
2008  0.0   7.0   5.0   4.0   2.0   3.0  9.0
2009  0.0  14.0  10.0   1.0   7.0   1.0  1.0

In [102]:
# use df.iloc[] to set by row or column index

# set first column to all 1's
df.iloc[:, 0] = np.ones((10, 1))

# set first row to all 0's
df.iloc[0, :] = np.zeros((1, 7))

In [103]:
df

      Sun   Mon   Tue   Wed   Thu   Fri  Sat
2000  0.0   0.0   0.0   0.0   0.0   0.0  0.0
2001  1.0   1.0  10.0  20.0  25.0  11.0  7.0
2002  1.0  15.0   3.0  11.0   2.0   6.0  9.0
2003  1.0  13.0   8.0   7.0  20.0  16.0  3.0
2004  1.0   8.0   7.0   5.0  13.0   1.0  1.0
2005  1.0  20.0  12.0   8.0  13.0  17.0  8.0
2006  1.0   3.0  30.0  20.0   8.0   7.0  2.0
2007  1.0   6.0  13.0  10.0  13.0   7.0  2.0
2008  1.0   7.0   5.0   4.0   2.0   3.0  9.0
2009  1.0  14.0  10.0   1.0   7.0   1.0  1.0

### Missing data

In [106]:
# set some missing values
df.iloc[0, 0] = float('nan')
df.iloc[1, 2] = float('nan')
df.iloc[2, 0] = float('nan')
df.iloc[3, 5] = float('nan')
df.iloc[9, 3] = float('nan')

In [107]:
df

      Sun   Mon   Tue   Wed   Thu   Fri  Sat
2000  NaN   0.0   0.0   0.0   0.0   0.0  0.0
2001  1.0   1.0   NaN  20.0  25.0  11.0  7.0
2002  NaN  15.0   3.0  11.0   2.0   6.0  9.0
2003  1.0  13.0   8.0   7.0  20.0   NaN  3.0
2004  1.0   8.0   7.0   5.0  13.0   1.0  1.0
2005  1.0  20.0  12.0   8.0  13.0  17.0  8.0
2006  1.0   3.0  30.0  20.0   8.0   7.0  2.0
2007  1.0   6.0  13.0  10.0  13.0   7.0  2.0
2008  1.0   7.0   5.0   4.0   2.0   3.0  9.0
2009  1.0  14.0  10.0   NaN   7.0   1.0  1.0

In [108]:
# we can drop rows that have missing data using dropna(how='any')
#df.dropna(how='any')

In [111]:
# fill missing data (returns a COPY of df)

df_copy = df.fillna(value=1.0)

In [113]:
df_copy

      Sun   Mon   Tue   Wed   Thu   Fri  Sat
2000  1.0   0.0   0.0   0.0   0.0   0.0  0.0
2001  1.0   1.0   1.0  20.0  25.0  11.0  7.0
2002  1.0  15.0   3.0  11.0   2.0   6.0  9.0
2003  1.0  13.0   8.0   7.0  20.0   1.0  3.0
2004  1.0   8.0   7.0   5.0  13.0   1.0  1.0
2005  1.0  20.0  12.0   8.0  13.0  17.0  8.0
2006  1.0   3.0  30.0  20.0   8.0   7.0  2.0
2007  1.0   6.0  13.0  10.0  13.0   7.0  2.0
2008  1.0   7.0   5.0   4.0   2.0   3.0  9.0
2009  1.0  14.0  10.0   1.0   7.0   1.0  1.0

In [116]:
# get boolean mask of missing values: True--NaN, False--Otherwise
bool_mask = pd.isna(df)

In [117]:
bool_mask

        Sun    Mon    Tue    Wed    Thu    Fri    Sat
2000   True  False  False  False  False  False  False
2001  False  False   True  False  False  False  False
2002   True  False  False  False  False  False  False
2003  False  False  False  False  False   True  False
2004  False  False  False  False  False  False  False
2005  False  False  False  False  False  False  False
2006  False  False  False  False  False  False  False
2007  False  False  False  False  False  False  False
2008  False  False  False  False  False  False  False
2009  False  False  False   True  False  False  False

### Operations

In general, operations on Panda data frames EXCLUDE missing data

###### Stats

In [119]:
df.describe()

       Sun        Mon        Tue        Wed        Thu        Fri        Sat
count  8.0  10.000000   9.000000   9.000000  10.000000   9.000000  10.000000
mean   1.0   8.700000   9.777778   9.444444  10.300000   5.888889   4.200000
std    0.0   6.600505   8.657046   6.821127   8.111035   5.510092   3.614784
min    1.0   0.000000   0.000000   0.000000   0.000000   0.000000   0.000000
25%    1.0   3.750000   5.000000   5.000000   3.250000   1.000000   1.250000
50%    1.0   7.500000   8.000000   8.000000  10.500000   6.000000   2.500000
75%    1.0  13.750000  12.000000  11.000000  13.000000   7.000000   7.750000
max    1.0  20.000000  30.000000  20.000000  25.000000  17.000000   9.000000

In [120]:
df.mean()

Sun     1.000000
Mon     8.700000
Tue     9.777778
Wed     9.444444
Thu    10.300000
Fri     5.888889
Sat     4.200000
dtype: float64

###### Apply

In [124]:
# we can apply functions to all the data in the data frame
df = df.apply(np.sqrt)
df

      Sun       Mon       Tue       Wed       Thu       Fri       Sat
2000  NaN  0.000000  0.000000  0.000000  0.000000  0.000000  0.000000
2001  1.0  1.000000       NaN  1.454215  1.495349  1.349504  1.275373
2002  NaN  1.402851  1.147203  1.349504  1.090508  1.251033  1.316074
2003  1.0  1.377980  1.296840  1.275373  1.454215       NaN  1.147203
2004  1.0  1.296840  1.275373  1.222845  1.377980  1.000000  1.000000
2005  1.0  1.454215  1.364262  1.296840  1.377980  1.424971  1.296840
2006  1.0  1.147203  1.529819  1.454215  1.296840  1.275373  1.090508
2007  1.0  1.251033  1.377980  1.333521  1.377980  1.275373  1.090508
2008  1.0  1.275373  1.222845  1.189207  1.090508  1.147203  1.316074
2009  1.0  1.390804  1.333521       NaN  1.275373  1.000000  1.000000

###### Histrogramming

In [125]:
s = pd.Series(np.random.randint(0, 7, size=10))
s.value_counts()

6    2
5    2
1    2
4    1
3    1
2    1
0    1
dtype: int64

###### String methods

In [129]:
s = pd.Series(['Sun', 'Mon', 'Tue', 'Wed', 'Thu', 'Fri', 'Sat'])
print(s, end='\n\n')
print(s.str.lower())

0    Sun
1    Mon
2    Tue
3    Wed
4    Thu
5    Fri
6    Sat
dtype: object

0    sun
1    mon
2    tue
3    wed
4    thu
5    fri
6    sat
dtype: object

### Merge

###### Concat

In [141]:
df = pd.DataFrame(np.random.randn(3, 5))
print('Original:\n\n', df, end='\n\n')
pieces = [df[0:1], df[1:2], df[2:3]]
print('Pieces:\n\n', pieces, end='\n\n')
concat = pd.concat(pieces)
print('Concatenation:\n\n', concat)

Original:

           0         1         2         3         4
0  1.143279 -0.703017 -1.350565  0.959751 -1.620186
1  1.146568 -0.397072 -0.476140  0.144476 -0.763393
2  0.670877 -0.701238 -0.612058 -1.088964 -3.958355

Pieces:

 [          0         1         2         3         4
0  1.143279 -0.703017 -1.350565  0.959751 -1.620186,           0         1        2         3         4
1  1.146568 -0.397072 -0.47614  0.144476 -0.763393,           0         1         2         3         4
2  0.670877 -0.701238 -0.612058 -1.088964 -3.958355]

Concatenation:

           0         1         2         3         4
0  1.143279 -0.703017 -1.350565  0.959751 -1.620186
1  1.146568 -0.397072 -0.476140  0.144476 -0.763393
2  0.670877 -0.701238 -0.612058 -1.088964 -3.958355

###### Append

In [209]:
df = pd.DataFrame(np.ones((3, 3)), columns=list('ABC'))
new_row = pd.DataFrame(np.zeros((1, 3)), columns=list('ABC'))

# append new row
df = df.append(new_row, ignore_index=True)

# append new column
new_col = pd.DataFrame(np.zeros((4, 1)))

df['D'] = new_col

df

     A    B    C    D
0  1.0  1.0  1.0  0.0
1  1.0  1.0  1.0  0.0
2  1.0  1.0  1.0  0.0
3  0.0  0.0  0.0  0.0

### Grouping

In [210]:
# applying a function to a group of data in df
df.groupby('A').sum()

       B    C    D
A
0.0  0.0  0.0  0.0
1.0  3.0  3.0  0.0

### Reshaping

###### Pivot tables

In [219]:
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3, 
                   'B' : ['A', 'B', 'C'] * 4,
                   'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2, 
                   'D' : np.random.randn(12), 'E' : np.random.randn(12)})

piv_table = pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])
piv_table

C             bar       foo
A     B
one   A  0.985986  0.161339
      B  0.044165 -1.252960
      C  0.346291 -1.598285
three A -1.824157       NaN
      B       NaN -0.648870
      C -0.620642       NaN
two   A       NaN  0.765404
      B -0.405681       NaN
      C       NaN -0.170043

### Categoricals

In [221]:
df = pd.DataFrame({'students':['Mark', 'John', 'Mary', 'Susan'], 
                   'grades':['C+', 'A', 'B-', 'A-']})

df

  students grades
0     Mark     C+
1     John      A
2     Mary     B-
3    Susan     A-

In [222]:
df['students']

0     Mark
1     John
2     Mary
3    Susan
Name: students, dtype: object

In [224]:
df['curved grade'] = ['B-', 'A', 'B', 'A']
df

  students grades curved grade
0     Mark     C+           B-
1     John      A            A
2     Mary     B-            B
3    Susan     A-            A

In [225]:
df['raw grades'] = df['grades'].astype("category")
df['raw grades']

0    C+
1     A
2    B-
3    A-
Name: raw grades, dtype: category
Categories (4, object): [A, A-, B-, C+]

In [226]:
# we can rename the categories inplace by using cat.categories
df['raw grades'].cat.categories = ['excellent', 'very good', 'good', 'okay']
df['raw grades']

0         okay
1    excellent
2         good
3    very good
Name: raw grades, dtype: category
Categories (4, object): [excellent, very good, good, okay]

In [228]:
df.sort_values(by='grades')

  students grades curved grade raw grades
1     John      A            A  excellent
3    Susan     A-            A  very good
2     Mary     B-            B       good
0     Mark     C+           B-       okay

### Getting data in/out

###### CSV

In [235]:
# writing to a csv file
df.to_csv('class.csv')

In [237]:
# reading from a csv file
pd.read_csv('class.csv')

   Unnamed: 0 students grades curved grade raw grades
0           0     Mark     C+           B-       okay
1           1     John      A            A  excellent
2           2     Mary     B-            B       good
3           3    Susan     A-            A  very good

###### Excel

In [240]:
# writing to an excel file
# NOTE: need openpyxl module for this operation
#df.to_excel('foo.xlsx', sheet_name='Sheet1')

ModuleNotFoundError: No module named 'openpyxl'